magento/magento-connector/magento-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/magento/api_updateCartProduct_negative.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:Magento">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:shoppingCartProductUpdate soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <sessionId xsi:type="xsd:String">%s(sessionId)</sessionId>
         <quoteId xsi:type="xsd:int">%s(quoteId)</quoteId>
         <storeId xsi:type="xsd:String">%s(storeId)</storeId>
		<products>
				<shoppingCartProductEntity>
                </shoppingCartProductEntity>
		</products>
      </urn:shoppingCartProductUpdate>
   </soapenv:Body>
</soapenv:Envelope>